
&НаСервереБезКонтекста
Процедура СформироватьНаСервере(ДатаНачала, ДатаОкончания, Товар)
	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	

	Если ЗначениеЗаполнено(Товар) Тогда
	    Запрос.УстановитьПараметр("Товар", Товар); 
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПродажиОбороты.Номенклатура КАК Номенклатура,
		               |	ПродажиОбороты.СуммаОборот КАК Сумма
		               |ИЗ
		               |	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, , Номенклатура = &Товар) КАК ПродажиОбороты";	
	
	Иначе
	    Запрос.Текст = "ВЫБРАТЬ
		               |	ПродажиОбороты.Номенклатура КАК Номенклатура,
		               |	ПродажиОбороты.СуммаОборот КАК Сумма
		               |ИЗ
		               |	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ПродажиОбороты";	
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока ВЫборка.Следующий() Цикл
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Товар - " + Выборка.Номенклатура + ", сумма = " + выборка.Сумма;
		Сообщение.Сообщить();	
		
		
	КонецЦикла
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере(Объект.ДатаНачала, Объект.ДатаОкончания, Объект.Товар);
КонецПроцедуры
