
&НаСервере
Процедура СформироватьНаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент,
		|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК Сумма,
		|	""Долг"" КАК Показатель
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ВзаиморасчетыСКонтрагентамиОстатки
		|		ПО Контрагенты.Ссылка = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
		|ГДЕ
		|	НЕ Контрагенты.ЭтоГруппа
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	ПродажиОбороты.СуммаОборот,
		|	""Продажи""
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(, , , ) КАК ПродажиОбороты
		|		ПО Контрагенты.Ссылка = ПродажиОбороты.Контрагент
		|ГДЕ
		|	НЕ Контрагенты.ЭтоГруппа
		|ИТОГИ ПО
		|	Контрагент";
	
ДеревоЗначений = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
ЗначениеВРеквизитФормы(ДеревоЗначений,"Дерево");

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
